[
  {
    "concept": "Dog",
    "triples": [
      "Dog is a domesticated mammal.",
      "Dog scientific name is Canis lupus familiaris.",
      "Dog belongs to the family Canidae.",
      "Dog was domesticated from wolves.",
      "Dog often serves as a companion animal.",
      "Dog can work as a service or working animal.",
      "Dog has a keen sense of smell.",
      "Dog has acute hearing.",
      "Dog communicates by barking.",
      "Dog can also communicate by growling.",
      "Dog sometimes communicates by whining.",
      "Dog has an omnivorous diet depending on care.",
      "Dog gives birth to litters of puppies.",
      "Dog develops social behavior with humans and other dogs.",
      "Dog appears in many breeds and size variations.",
      "Dog uses its tail for balance and communication.",
      "Dog may have a dewclaw on some breeds.",
      "Dog lifespan varies by breed and care.",
      "Dog is highly trainable for tasks and commands.",
      "Dog provides assistance in therapy and service roles."
    ]
  },
  {
    "concept": "Cat",
    "triples": [
      "Cat is a small domesticated carnivorous mammal.",
      "Cat scientific name is Felis catus.",
      "Cat belongs to the family Felidae.",
      "Cat descended from the African wildcat.",
      "Cat commonly lives as a pet.",
      "Cat helps control rodent populations.",
      "Cat is an obligate carnivore.",
      "Cat has excellent night vision.",
      "Cat has very acute hearing.",
      "Cat grooms itself frequently.",
      "Cat often purrs to communicate contentment.",
      "Cat meows often when interacting with humans.",
      "Cat has retractable claws.",
      "Cat has whiskers for tactile sensing.",
      "Cat gives birth to litters of kittens.",
      "Cat may be solitary or social depending on environment.",
      "Cat lifespan varies by lifestyle and care.",
      "Cat is most active at dawn and dusk.",
      "Cat holds longstanding cultural significance.",
      "Cat has a long history of association with humans."
    ]
  },
  {
    "concept": "Fish",
    "triples": [
      "Fish are gill-bearing aquatic vertebrates.",
      "Fish breathe using gills.",
      "Fish are mostly ectothermic (cold-blooded).",
      "Fish use fins to swim.",
      "Many fish have scales covering their bodies.",
      "Fish include jawless, cartilaginous, and bony groups.",
      "Many fish species reproduce by laying eggs.",
      "Fish live in freshwater and marine habitats.",
      "Many fish have a lateral line to detect water movement.",
      "Many bony fish have a swim bladder for buoyancy.",
      "Fish diets vary and include herbivores, carnivores, and omnivores.",
      "Fish act as both consumers and predators in aquatic food webs.",
      "Humans use fish as a major food source through fisheries and aquaculture.",
      "Fish have paired and unpaired fins for movement.",
      "Fish lifespans vary widely across species.",
      "Some fish undergo larval stages and metamorphosis.",
      "Many fish species exhibit schooling behavior.",
      "Some fish species are capable of electroreception.",
      "Many fish species face threats from overfishing and habitat loss.",
      "Traditional classifications consider fish a paraphyletic group."
    ]
  }
]
